k6/frequent/smoke.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s

running (10.1s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s

     ✓ load main page

     checks.........................: 100.00% ✓ 10       ✗ 0
     data_received..................: 18 kB   1.7 kB/s
     data_sent......................: 1.0 kB  100 B/s
     http_req_blocked...............: avg=3.37ms  min=2.83µs  med=2.95µs  max=33.76ms  p(90)=3.37ms   p(95)=18.56ms
     http_req_connecting............: avg=68µs    min=0s      med=0s      max=680µs    p(90)=68µs     p(95)=374µs
   ✓ http_req_duration..............: avg=2.42ms  min=1.84ms  med=2.04ms  max=5.89ms   p(90)=2.76ms   p(95)=4.33ms
       { expected_response:true }...: avg=2.42ms  min=1.84ms  med=2.04ms  max=5.89ms   p(90)=2.76ms   p(95)=4.33ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 10
     http_req_receiving.............: avg=86.82µs min=52.63µs med=76.89µs max=218.09µs p(90)=100.13µs p(95)=159.11µs
     http_req_sending...............: avg=99.19µs min=73.91µs med=84.11µs max=239µs    p(90)=106.83µs p(95)=172.92µs
     http_req_tls_handshaking.......: avg=1.54ms  min=0s      med=0s      max=15.49ms  p(90)=1.54ms   p(95)=8.52ms
     http_req_waiting...............: avg=2.23ms  min=1.67ms  med=1.88ms  max=5.59ms   p(90)=2.46ms   p(95)=4.02ms
     http_reqs......................: 10      0.993356/s
     iteration_duration.............: avg=1s      min=1s      med=1s      max=1.03s    p(90)=1.01s    p(95)=1.02s
     iterations.....................: 10      0.993356/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1